src/test/java/com/taurusLoadJunit/taurusLoadJunit/blazemeter_junit.yaml
---
execution:
#  - executor: selenium
#    runner: junit
  - executor: junit
    iterations: 10  # loop over test suite for 10 times
    concurrency: 50   # number of virtual users
    ramp-up: 30s       # time of load growing
    scenario: javaTest
scenarios:
  javaTest:
    script: /Users/shrey.dhingra/Downloads/taurusLoadJunit/src/test/java/com/taurusLoadJunit/taurusLoadJunit/TaurusLoadJunitApplicationTests.java
    additional-classpath:
      - /Users/shrey.dhingra/Downloads/taurusLoadJunit/build/libs/taurusLoadJunit-all-0.0.1-SNAPSHOT.jar

modules:
#  selenium:
#    selenium-tools:
      junit:
        compile-target-java: 1.8
#        jar-name: /Users/shrey.dhingra/Downloads/taurusLoadJunit/build/libs/taurusLoadJunit-all-0.0.1-SNAPSHOT.jar